[About Language File]
Version=10.0.0
Date=28.09.2015
Author=SATIT  ARCHANUSORN
Email=acha937@gmail.com
Comments=I translate Thai. Thank you.

[MainForm]
ActionDirectoryContextMenu:h=เมนูตายตัว
ActionDirectoryContextMenu= เมนู&ตายตัว
ActionDirectoryDelete:h=ลบไฟล์หรือไดเรคทอรี่
ActionDirectoryDelete=&ลบ
ActionDirectoryFindInFiles:h=ค้นหาข้อความในหลายไฟล์
ActionDirectoryFindInFiles=ค้นหา&ในไฟล์...
ActionDirectoryProperties:h=ดูไฟล์/คุณสมบัติไดเรคทอรี่
ActionDirectoryProperties=&คุณสมบัติ...
ActionDirectoryRefresh:h=Refresh files
ActionDirectoryRefresh=&Refresh
ActionDirectoryRename:h=เปลี่ยนชื่อไฟล์หรือไดเรคทอรี่
ActionDirectoryRename=เปลี่ยน&ชื่อ
ActionDocument=&เอกสาร(Document)
ActionDocumentFormat=แบบแผน
ActionDocumentFormatSQL:h=แบบแผนSQL
ActionDocumentFormatSQL=แบบแผน SQL
ActionDocumentFormatXML:h=แบบแผน XML
ActionDocumentFormatXML=&แบบแผน XML
ActionDocumentFormatJSON:h=แบบแผน JSON
ActionDocumentFormatJSON=&แบบแผน JSON
ActionDocumentFormatJSONMinify=Minify
ActionDocumentFormatJSONMinify:t=Translation needed
ActionDocumentFormatJSONIndent2=Indent 2
ActionDocumentFormatJSONIndent2:t=Translation needed
ActionDocumentFormatJSONIndent3=Indent 3
ActionDocumentFormatJSONIndent3:t=Translation needed
ActionDocumentFormatJSONIndent4=Indent 4
ActionDocumentFormatJSONIndent4:t=Translation needed
ActionDocumentInfo:h=การนับเส้น, คำ, และตัวอักษร
ActionDocumentInfo=&เส้น, คำ, และตัวอักษรการนับ...
ActionDocumentViewInBrowser:h=มุมมองเอกสารปัจจุบันในการค้นหาขั้นพื้นฐาน
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&มุมมองในการค้นหา
ActionEdit=แก้&ไข (Edit)
ActionEditCopy:h=การเลือกทำสำเนาและใส่มันไปยังคลิปบอร์ด
ActionEditCopy:s=Ctrl+C
ActionEditCopy=ทำ&สำเนา (Copy)
ActionEditCut:h=ตัดการเลือกและใส่มันไปยังคลิปบอร์ด
ActionEditCut:s=Ctrl+X
ActionEditCut=ตัด&(Cut)
ActionEditDecreaseIndent:h=ลดไม่รอยเว้า
ActionEditDecreaseIndent:s=Shift+Ctrl+U
ActionEditDecreaseIndent=&ลดลง(Decrease)
ActionEditDelete=ลบ& (Delete)
ActionEditDeleteEndOfLine:h=ลบตอนจบของเส้น
ActionEditDeleteEndOfLine:s=การเปลี่ยนแปลง+Ctrl+Y
ActionEditDeleteEndOfLine=&ตอนจบของเส้น
ActionEditDeleteLine:h=ลบเส้น
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&เส้น
ActionEditDeleteWhitespace:h=เอา whitespace ทั้งหมด ออก จากข้อความที่เลือก
ActionEditDeleteWhitespace=W&hitespace
ActionEditDeleteWord:h=ลบคำ
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&คำ
ActionEditIncreaseIndent:h=เพิ่มไม่รอยเว้า
ActionEditIncreaseIndent:s=Shift+Ctrl+I
ActionEditIncreaseIndent=เพิ่มขึ้น
ActionEditIndent=I&ndent
ActionEditInsert=สอดใส่ (Insert)
ActionEditInsertDateTime:h=ใส่วันที่และเวลา
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&วันที่และเวลา
ActionEditInsertLine:h=สอดใส่เส้น
ActionEditInsertLine:s=Ctrl+เข้าไป
ActionEditInsertLine=บรร&ทัด(Line)
ActionEditInsertTag:h=ใส่ HTML/XML ติดป้าย
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XML ติดป้าย...
ActionEditPaste:h=ใส่สิ่งที่บรรจุคลิปบอร์ด
ActionEditPaste:s=Ctrl+V
ActionEditPaste=วางแปะ& (Paste)
ActionEditRedo:h=ดำเนินการใหม่กับการกระทำที่ไม่ดำเนินการที่ผ่านมา
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=ดำเนิน&การใหม่(Redo)
ActionEditSelectAll:h=เลือกทั้งหมด
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=เลือก&ทั้งหมด(Select all)
ActionEditSort=ช&นิด(Sort)
ActionEditSortAsc:h=การเฟื่องฟูชนิด
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&การเฟื่องฟู
ActionEditSortDesc:h=ชนิดการลงมาชนิด
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&การลงมา
ActionEditToggleCase:h=เปลี่ยนกรณี
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=เพื่อ&กรณี
ActionEditToggleCaseAlternating:h=Toggle alternating case
ActionEditToggleCaseAlternating:t=Translation needed
ActionEditToggleCaseAlternating=Alternating
ActionEditToggleCaseLower:h=Toggle lower case
ActionEditToggleCaseLower:t=Translation needed
ActionEditToggleCaseLower=Lower
ActionEditToggleCaseSentence:h=Toggle sentence case
ActionEditToggleCaseSentence:t=Translation needed
ActionEditToggleCaseSentence=Sentence
ActionEditToggleCaseTitle:h=Toggle title case
ActionEditToggleCaseTitle:t=Translation needed
ActionEditToggleCaseTitle=Title
ActionEditToggleCaseUpper:h=Toggle upper case
ActionEditToggleCaseUpper:t=Translation needed
ActionEditToggleCaseUpper=Upper
ActionEditUndo:h=ไม่ดำเนินการ-การกระทำสุดท้าย
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=ไม่&ดำเนินการ(Undo)
ActionFile=&ไฟล์ (File)
ActionFileClose:h=ปิดเอกสารสำคัญ
ActionFileClose:s=Ctrl+F4
ActionFileClose=&ปิด (Close)
ActionFileCloseAll:h=ปิดไฟล์ที่เปิดอยู่ทั้งหมด
ActionFileCloseAll=ปิด&ทั้งหมด (Close all)
ActionFileCloseAllOther:h=ปิดหน้าอื่นๆทั้งหมด
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=ปิด&ไฟล์อื่นๆทั้งหมด
ActionFileExit:h=ออกจากแอปปลิเคชั่น
ActionFileExit:s=Alt+F4
ActionFileExit=ออ&ก (Exit)
ActionFileNew:h=สร้างเอกสารใหม่
ActionFileNew:s=Ctrl+N
ActionFileNew=&ใหม่ (New)
ActionFileOpen:h=เปิดเอกสารที่มีอยู่
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&เปิด (Open)...
ActionFilePrint:h=พิมพ์เอกสารสำคัญ
ActionFilePrint:s=Ctrl+P
ActionFilePrint=พิม&พ์ (Print)...
ActionFilePrintPreview:h=ตัวอย่างต้นฉบับเอกสารสำคัญ
ActionFilePrintPreview=พิมพ์&ตัวอย่างต้นฉบับ(Print preview)...
ActionFileProperties:h=ดูคุณสมบัติไฟล์
ActionFileProperties=คุณสม&บัติ (Properties)...
ActionFileReopen=&เปิดใหม่(Reopen)
ActionFileReopenClear=&ลบล้าง (Clear)
ActionFileSave:h=บันทึกเอกสารสำคัญ
ActionFileSave:s=Ctrl+S
ActionFileSave=&บันทึก (Save)
ActionFileSaveAll:h=บันทึกเอกสารทั้งหมด
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=บันทึก&ทั้งหมด (Save all)
ActionFileSaveAs:h=บันทึกเอกสารสำคัญโดยเปลี่ยนชื่อใหม่
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=บัน&ทึกเป็น (Save as)...
ActionFileSelectFromDirectory:h=เลือกไฟล์จากไดเรคทอรี่ที่ใช้งาน
ActionFileSelectFromDirectory=เลือกจากไดเรคทอรี่
ActionHelp=&ช่วยเหลือ(Help)
ActionHelpAboutEditBone:h=แสดงข้อมูลเบื้องต้นเกี่ยวกับ EditBone
ActionHelpAboutEditBone=&เกี่ยวกับ EditBone
ActionHelpCheckForUpdates:h=ตรวจหาของใหม่
ActionHelpCheckForUpdates=&ตรวจหาของใหม่
ActionHelpVisitHomepage:h=เยี่ยม EditBone โฮมเพ็จ - http://www.bonecode.com/
ActionHelpVisitHomepage=&เยี่ยมโฮมเพ็จ
ActionMacro:t=Translation needed
ActionMacro=Macro
ActionMacroOpen:h=เปิดmacro ที่มีอยู่
ActionMacroOpen=&เปิด (Open)...
ActionMacroPause:h=บันทึกหรือหยุดพัก macro
ActionMacroPause:s=Shift+Ctrl+R
ActionMacroPause=&บันทึก (Record)
ActionMacroPlayback:h=การเล่น macro
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&การเล่น
ActionMacroRecord:h=บันทึกหรือหยุดพัก macro
ActionMacroRecord:s=Shift+Ctrl+R
ActionMacroRecord=&บันทึก (Record)
ActionMacroSaveAs:h=บันทึก macro กับชื่อใหม่
ActionMacroSaveAs=บั&นทึกเป็น...
ActionMacroStop:h=หยุด การบันทึก macro
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&หยุด (Stop)
ActionOutputCloseAllOtherPages:h=เลือกอื่นๆทั้งหมด
ActionOutputCloseAllOtherPages=เลือกหน้า&อื่นๆทั้งหมด
ActionOutputClose:h=ปิดหน้าปัจจุบัน
ActionOutputClose=&ปิด
ActionOutputCloseAll:h=ปิดหน้าทั้งหมด
ActionOutputCloseAll=ปิด&ทั้งหมด
ActionOutputCopyAllToClipboard=ทำ&สำเนา ทั้งหมดเพื่อคลิปบอร์ด
ActionOutputCopyAllToClipboard:h=ทำสำนาทั้งหมดสู่คลิปบอร์ด
ActionOutputCopySelectedToClipboard=ทำสำนาเลือกเพื่อคลิปบอร์ด
ActionOutputCopySelectedToClipboard:h=ทำสำนาเลือกเพื่อคลิปบอร์ด
ActionOutputOpenAll=&เปิดทั้งหมด
ActionOutputOpenAll:h=เปิดไฟล์ทั้งหมด
ActionOutputOpenSelected=&เลือกเปิด
ActionOutputOpenSelected:h=ไฟล์ที่เลือกเปิด
ActionOutputSelectAll=เลือกทั้งหมด
ActionOutputSelectAll:h=เลือกไฟล์ทั้งหมด
ActionOutputUnselectAll=ไม่เลือกทั้งหมด
ActionOutputUnselectAll:h=ไม่เลือกไฟล์ทั้งหมด
ActionSearch=&การค้นหา (Search)
ActionSearchClearBookmarks:h=ทำความสะอาดที่คั่นหนังสือทั้งหมด
ActionSearchClearBookmarks=ลบล้าง &ที่คั่นหนังสือ
ActionSearchClose:h=Close
ActionSearchClose:t=Translation needed
ActionSearchFindInFiles:h=ค้นหาข้อความในหลายไฟล์
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=ค้นหา&ในไฟล์...
ActionSearchFindNext:h=ค้นหาข้อความที่จับคู่ถัดไป
ActionSearchFindNext:s=F3
ActionSearchFindNext=การค้นหา&ถัดไป
ActionSearchFindPrevious:h=ค้นหาข้อความที่จับคู่ที่ผ่านมา
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=การค้นหา&ที่ผ่านมา
ActionSearchGoToBookmarks:h=ไปที่คั่นหนังสือ
ActionSearchGoToBookmarks=ไปที่คั่นหนังสือ
ActionSearchGoToLine:h=ไปที่เส้น
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=ไปที่เส้น
ActionSearchOptions:h=Options
ActionSearchOptions:t=Translation needed
ActionSearchReplace:h=เคลื่อนย้ายข้อความที่เจาะจงกับข้อความที่แตกต่าง
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&แทนที่ (Replace)...
ActionSearchSearch:h=ค้นหาข้อความที่เจาะจง
ActionSearchSearch:s=Ctrl+F
ActionSearchSearch=การ&ค้นหา(Search)...
ActionSearchToggleBookmark:h=ชุดหรือที่คั่นหนังสือชัดเจนที่บรรทัดปัจจุบัน. ที่คั่นหนังสือสามารถยังถูกตั้งโดยการใช้ Ctrl+Shift+1..9. ไปที่ที่คั่นหนังสือโดยการใช้ Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&เปลี่ยนที่คั่นหนังสือ
ActionSearchToggleBookmarks:h=เปลี่ยนที่คั่นหนังสือ
ActionSearchToggleBookmarks=ที่&คั่นหนังสือ
ActionToolbarMenuLanguage=&ภาษา (Language)
ActionToolbarMenuSkin=ส&ไตส์...(Style)
ActionToolbarMenuView:t=Translation needed
ActionToolbarMenuView=&View
ActionTools=&เครื่องมือ (Tools)
ActionToolsCharacterMap:h=ใส่ตัวอักษร unicode เพื่อเอกสารที่ตื่นตัวโดยกดdouble-clicking
ActionToolsCharacterMap=&ตัวอักษรถอดรห้ส Unicode ...
ActionToolsCompareFiles:h=เปรียบเทียบไฟล์
ActionToolsCompareFiles=&เปรียบเทียบไฟล์...
ActionToolsConvert:h=แปลงหน่วย numerical
ActionToolsConvert=กลับเปลี่ยน& (Convert)...
ActionToolsLanguageEditor:h=ตัวแก้ไขภาษา
ActionToolsLanguageEditor=&ผู้แก้ไขภาษา(Language editor)...
ActionToolsOptions:h=ข้อกำหนดทางเลือก
ActionToolsOptions=ทาง&เลือก (Options)...
ActionToolsSelectForCompare:h=เลือกเอกสารสำหรับเปรียบเทียบ
ActionToolsSelectForCompare=เลือกสำหรับเปรียบเทียบ...
ActionView=&มุมมอง  (View)
ActionViewCloseDirectory:h=ปิดไดเรคทอรี่ที่ใช้งาน
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&ปิดไดเรคทอรี่(Close directory)
ActionViewColorSelection:h=Show or hide the color selection
ActionViewColorSelection:t=Translation needed
ActionViewColorSelection=Color
ActionViewDirectory:h=แสดงหรือซ่อนไดเรคทอรี่
ActionViewDirectory=&ไดเรคทอรี่
ActionViewEditDirectory:h=แก้ไขไดเรคทอรี่ที่ใช้งาน
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&แก้ไขไดเรคทอรี่...
ActionViewEncodingSelection:h=แสดงหรือซ่อนการเลือกที่เข้ารหัส
ActionViewEncodingSelection=การถอด&รหัส(Encoding)
ActionViewFiles:h=การค้นหาไฟล์จากไดเรคทอรี่ที่เลือกและไดเรคทอรี่ย่อยของมัน
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&ไฟล์(Files)...
ActionViewHighlighterSelection:h=แสดงหรือซ่อนการเลือกhighlighter
ActionViewHighlighterSelection=&highlighter
ActionViewLineNumbers:h=เปลี่ยนหมายเลขเส้น
ActionViewLineNumbers=หมายเลข&เส้น
ActionViewMainMenu:h=Show or hide the main menu
ActionViewMainMenu:t=Translation needed
ActionViewMainMenu=Main menu
ActionViewMenuBar:h=Show or hide the menu bar
ActionViewMenuBar:t=Translation needed
ActionViewMenuBar=Menu bar
ActionViewMiniMap:h=แสดงหรือซ่อน minimap
ActionViewMiniMap=Minimap
ActionViewNextPage:h=ไปที่หน้าถัดไป
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&หน้าถัดไป
ActionViewOpenDirectory:h=เปิดไดเรคทอรี่ใหม่
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&เปิดไดเรคทอรี่(Open directory)...
ActionViewOutput:h=แสดงหรือซ่อนสิ่งที่นำออก
ActionViewOutput=O&utput
ActionViewPreviousPage:h=ไปที่หน้าที่ผ่านมา
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&หน้าที่ผ่านมา
ActionViewSelectionMode:h=เปลี่ยนโหมดการเลือก. ยังการกด Alt บนตัวแก้จะเปลี่ยนโหมดการเลือก.
ActionViewSelectionMode=การเลือก &โหมด
ActionViewSpecialChars:h=เปลี่ยนตัวอักษรพิเศษ
ActionViewSpecialChars=ตัวอักษรพิเศษ&(Special chars)
ActionViewSplit:h=แบ่งเอกสาร
ActionViewSplit=&แบ่ง (Split)
ActionViewStatusBar:h=แสดงหรือซ่อนแถบสถานะ
ActionViewStatusBar=&แถบสถานะ (Status bar)
ActionViewToolbar:h=แสดงหรือซ่อนแถบเครื่องมือ
ActionViewToolbar=&แถบเครื่องมือ(Toolbar)
ActionViewWordWrap:h=เปลี่ยนWord wrap
ActionViewWordWrap=&Word wrap
ActionViewXMLTree:h=แสดงหรือซ่อน XML tree
ActionViewXMLTree=&XML tree
ActionXMLTreeRefresh:h=Refresh XML tree
ActionXMLTreeRefresh=&Refresh

[AskYesOrNo]
CancelSearch=ยกเลิกการค้นหา, คุณแน่ใจไหม?
CloseDirectory=ปิดไดเรคทอรี่ %s, คุณแน่ใจ ไหม?
DeleteDirectory=ลบไดเรคทอรี่ %s, คุณแน่ใจไหม?
DeleteFile=ลบไฟล์ %s, คุณแน่ใจไหม?
DeleteLine=ลบบรรทัด, คุณแน่ใจไหม?
DocumentTimeChanged=เอกสาร %เวลา/วันที่เปลี่ยน. โหลดใหม่?
NewVersion=เวอร์ชันใหม่ %s ของ %s มีให้.%sคุณชอบดาวน์โหลดมันจากอินเตอร์เนต?
RecordMacro=บันทึกmacro ใหม่, คุณแน่ใจไหม?
ReplaceOccurence=เคลื่อนย้ายแทนที่ occurence นี้ ของ '%s'?
SaveChanges=บันทึกการเปลี่ยนแปลง?
SearchMatchNotFound=การค้นหาไม่ค้นพบ.%การเริ่มต้นค้นหาจากไฟล์?
SearchStringNotFound=ข้อความการค้นหา '%s' ไม่ค้นพบ

[Message]
CannotFindString=ไม่สามารถค้นหาข้อความ '%s'
DocumentStatistics=การนับบรรทัด: %d%Word count: %d%sCharacter การนับ: %d
LatestVersion=คุณกำลังใช้เวอร์ชันล่าสุด.

[ErrorMessage]
EnterPath=Enter path.
EnterPath:t=Translation needed
EnterTabName=เข้าไปแถบชื่อ.
FileNotFound=ไม่ค้นพบ %s'ไฟล์ .
PathNotExist=Path does not exist.
PathNotExist:t=Translation needed
RootDirectoryNotExist=ไดเรคทอรี่รากไม่มีอยู่.

[WarningMessage]
FileAccessError=ไฟล์ %s ข้อผิดพลาดที่เข้าถึง.

[Constant]
AllFiles=ไฟล์ทั้งหมด
Arrow:t=Translation needed
Arrow=Arrow
AutoSave=บันทึกอัตโนมัติ
Block=สกัดกั้น
Bookmark=ที่คั่นหนังสือ
Bottom=ด้านล่าง
Circle=Circle
Circle:t=Translation needed
Color=Color
Color:t=Translation needed
CompareFiles=เปรียบเทียบไฟล์
CountingFiles=การนับไฟล์...
DirectoryItems=Directory items
DirectoryItems:t=Translation needed
Document=เอกสาร(Document)
Dot=Dot
Dot:t=Translation needed
DownloadCancelling=การยกเลิก...
DownloadDone=ทำ.
EditDirectory=ผู้แก้ไขไดเรคทอรี่
Encoding=Encoding
Encoding:t=Translation needed
Enter=Enter
Enter:t=Translation needed
FileMaskItems=File mask items
FileMaskItems:t=Translation needed
FilesFound=%dไฟล์(s) ได้ถูกค้นพบใน %s
FooterLeft=ข้อความท้ายหน้า - ด้านซ้าย
FooterRight=ข้อความท้ายหน้า - ด้านขวา
GoToLine=Go to line
GoToLine:t=Translation needed
HalfBlock=Half block
HeaderLeft=หัวข้อ - ด้านซ้าย
HeaderRight=หัวข้อ - ด้านขวา
Hide=ซ่อน
Highlighter=Highlighter
Highlighter:t=Translation needed
HorizontalLine=เส้นแนวนอน
Insert=ใส่(Insert)
InsertTags=Insert HTML/XML Tags
InsertTags:t=Translation needed
InvalidName=Invalid name
InvalidName:t=Translation needed
LanguageEditor=ผู้แก้ไขภาษา - [%s]
Line=เส้น
MatchFound=%d match%s found
MatchFound:t=Translation needed
MatchFoundPluralExtension=es
MatchFoundPluralExtension:t=Translation needed
Minute=ต่ำสุด
Modified=ปรับแต่ง
OccurencesFound=%d occurence(s) ได้ถูกค้นพบใน %s
Open=เปิด
OpenDirectory=ไดเรคทอรี่เปิด
Overwrite=เขียนทับ
Pilcrow=Pilcrow
Pilcrow:t=Translation needed
Position=Position: %d
Position:t=Translation needed
PreviewDocumentPage=หน้า: $PAGENUM$ ของ $PAGECOUNT$
PreviewPage= หน้า: %d / %d
PreviewPrintDocument=การพิมพ์ (%s)|พิมพ์เอกสารบน %s
PrintedBy=พิมพ์โดย %s
Rename=คุณต้องการเปลี่ยนชื่อ %s เพื่อ %s %ไหม?
RenameFailed=%s rename failed
RenameFailed:t=Translation needed
SaveAs=บันทึกเป็น
SearchFor=ค้นหาเพื่อ '%s'
Second =s
SelectRootDirectory=เลือกรากไดเรคทอรี
Solid=Solid
Solid:t=Translation needed
Square=Square
Square:t=Translation needed
TextToFindItems=Text to find items
TextToFindItems:t=Translation needed
ThinHorizontalLine=Thin horizontal line
ThinHorizontalLine:t=Translation needed
ThinVerticalLine=Thin vertical line
ThinVerticalLine:t=Translation needed
Top=ด้านบน
TopLine=บรรทัดบนสุด: %d
VersionInfoNotFound=คำแนะนำเวอร์ชันไม่ค้นพบ.
VerticalLine=เส้นแนวดิ่ง

[DialogConstant]
SMsgDlgAbort=&หลีกเลี่ยง(Abort)
SMsgDlgAll=&ทั้งหมด
SMsgDlgCancel=ยกเลิก
SMsgDlgClose=&ปิด(Close)
SMsgDlgConfirm=ยืนยัน
SMsgDlgError=ข้อผิดพลาด
SMsgDlgHelp=&ช่วยเหลือ (Help)
SMsgDlgHelpHelp=ช่วยเหลือ (Help)
SMsgDlgHelpNone=ไม่มีความช่วยเหลือให้
SMsgDlgIgnore=&ไม่สนใจ(Ignore)
SMsgDlgInformation=ข้อมูลเบื้องต้น
SMsgDlgNo=&ไม่
SMsgDlgNoToAll=ไม่& ทั้งหมด
SMsgDlgOK=คกลง(OK)
SMsgDlgRetry=&ความพยายาม(Retry)
SMsgDlgWarning=การเตือน
SMsgDlgYes=&ใช่
SMsgDlgYesToAll=ใช่ &ทั้งหมด

[ColorConstant]
clBlack=ดำ
clMaroon=Maroon
clGreen=สีเขียว
clOlive=Olive
clNavy=Navy
clPurple=สีม่วง
clTeal=สีเขียวน้ำทะเล
clGray=สีเทา
clSilver=เงิน
clRed=สีแดง
clLime=ปูนขาว
clYellow=สีเหลือง
clBlue=สีน้ำเงิน
clFuchsia=Fuchsia
clAqua=Aqua
clWhite=สีขาว
clMoneyGreen=สีเขียวเงิน
clSkyBlue=สีฟ้า
clCream=ครีม
clMedGray=สีเทากลาง
clActiveBorder=พรมแดนที่ตื่นตัว
clActiveCaption=หัวเรื่องที่ตื่นตัว
clAppWorkSpace=workspace แอปปลิเคชั่น
clBackground=พื้นหลัง
clBtnFace=หน้าปุ่ม
clBtnHighlight=Button highlight
clBtnShadow=Button shadow
clBtnText=ข้อความปุ่ม
clCaptionText=ข้อความหัวเรื่อง
clDefault=ข้อกำหนดพื้นฐาน(Default)
clGradientActiveCaption=Gradient หัวเรื่องที่ตื่นตัว
clGradientInactiveCaption=Gradient ไม่ตอบสนองหัวเรื่อง
clGrayText=ข้อความสีเทา
clHighlight=Highlightพื้นหลัง
clHighlightText=Highlight text
clHotLight=Hot light
clInactiveBorder=ไม่ตอบสนองพรมแดน
clInactiveCaption=ไม่ตอบสนองหัวเรื่อง
clInactiveCaptionText=ไม่ตอบสนองข้อความหัวเรื่อง
clInfoBk=คำแนะนำพื้นหลัง
clInfoText=ข้อความคำแนะนำ
clMenu=พื้นหลังเมนู
clMenuBar=แถบเมนู
clMenuHighlight=Menu highlight
clMenuText=ข้อความเมนู
clNone=ไม่มี
clScrollBar=Scroll bar
cl3DDkShadow=เงาที่มืด 3D
cl3DLight=ความสว่าง 3D
clWindow=พื้นหลังวินโดว์ส
clWindowFrame=เฟรมวินโดว์ส
clWindowText=ข้อความวินโดว์ส

[FileTypes]
ActionScript=ActionScript ไฟล์ (*.as)
Assembler 68HC11=68HC11 ตัวแปลภาษาแอสเซมบลีไฟล์ (*.hc11;*.asc)
AutoIt v3=AutoIt ไฟล์ (*.au3)
AWK=AWK scripts (*.awk)
C#=C# ไฟล์ (*.cs)
C++=C++ ไฟล์ (*.cpp;*.hpp)
C=C ไฟล์ (*.c;*.h)
CSS=Cascading Stylesheet ไฟล์ (*.css)
D=D ไฟล์ (*.d;*.di)
Delphi Form Module=Delphi Form Module ไฟล์ (*.dfm)
Free Pascal=Free Pascal ไฟล์ (*.pp)
HTML with Scripts=HTML ไฟล์ (*.html;*.htm)
INI=INI ไฟล (*.ini;*.lng)
Inno Setup=Inno Setup ไฟล (*.iss)
Java=Java ไฟล์ (*.java)
JavaScript=JavaScript ไฟล์ (*.js)
JSON=JSON ไฟล์ (*.json)
Lua=Lua ไฟล์ (*.lua)
MATLAB=MATLAB ไฟล์ (*.matlab)
MS-DOS Batch=MS-DOS Batch ไฟล์ (*.bat;*.cmd)
Objective-C=Objective-C ไฟล์ (*.m)
Object Pascal=Pascal ไฟล์ (*.pas;*.dpr;*.dpk)
Perl=Perl ไฟล์ (*.pl;*.pm;*.cgi)
PHP=PHP ไฟล์ (*.php;*.class;*.inc)
Python=Python ไฟล์ (*.py)
Ruby=Ruby ไฟล์ (*.rb;*.rbw)
SQL=SQL ไฟล์ (*.sql)
Text=Text ไฟล์(*.txt)
Visual Basic=Visual Basic ไฟล์ (*.vb;*.bas)
XML=XML ไฟล์ (*.xml;*.xsd;*.xsl;*.xslt;*.dtd)
Macro=Macro files (*.mcr)|*.mcr
Language=Language files (*.lng)|*.lng
Macro=Macro ไฟล์  (*.mcr)|*.mcr
Language=ไฟล์ภาษา (*.lng)|*.lng

[ConfirmReplaceDialog]
ButtonCancel=ยกเลิก
Caption=ยืนยันแทนที่
ButtonNo=&ไม่มี
ButtonYes=&ใช่
ButtonYesToAll=ใช่เพื่อ&ทั้งหมด

[DownloadURLDialog]
ButtonCancel=ยกเลิก
Caption=ดาวน์โหลด

[FindInFilesDialog]
ButtonCancel=ยกเลิก
Caption=ค้นหาในไฟล์
StickyLabelCaseSensitive=กรณีรู้สึกอ่อนไหว
ComboBoxFileMask=หน้ากากไฟล์
ButtonFind=&การค้นหา
ComboBoxTextToFind=ข้อความเพื่อค้นหา
ComboBoxDirectory=ไดเรคทอรี่
StickyLabelIncludeSubdirectories=รวมถึงไดเรคทอรี่ย่อย
GroupBoxOptions=ทางเลือก
GroupBoxSearchDirectoryOptions=การค้นหาไดเรคทอรี่ทางเลือก

[InputQueryDialog]
ButtonOK=ตกลง(OK)
ButtonCancel=ยกเลิก

[ItemListDialog]
ActionInsert=Insert
ActionInsert:h=Insert item
ActionInsert:t=Translation needed
ActionDelete=Delete
ActionDelete:h=Delete item
ActionDelete:t=Translation needed
ActionClearAll=Clear all
ActionClearAll:h=Clear all items
ActionClearAll:t=Translation needed
ActionMoveUp=Move up
ActionMoveUp:h=Move selected item up
ActionMoveUp:t=Translation needed
ActionMoveDown=Move down
ActionMoveDown:h=Move selected item down
ActionMoveDown:t=Translation needed
ActionSort=Sort
ActionSort:h=Sort items
ActionSort:t=Translation needed

[SearchOptionsDialog]
StickyLabelBeepIfSearchStringNotFound=Beep ถ้าข้อความการค้นหาไม่ค้นพบ
StickyLabelCaseSensitive=กรณีรู้สึกอ่อนไหว
StickyLabelEntireScope=Entire scope
StickyLabelEntireScope:t=Translation needed
StickyLabelHighlightResult=Highlight results
StickyLabelHighlightResult:t=Translation needed
StickyLabelRegularExpression=การแสดงออกประจำ
StickyLabelSearchOnTyping=Search on typing
StickyLabelSearchOnTyping:t=Translation needed
StickyLabelSelectedOnly=Selected only
StickyLabelSelectedOnly:t=Translation needed
StickyLabelShowSearchStringNotFound=แสดงข้อความการค้นหาไม่ข้อความค้นพบ
StickyLabelWildCard=Wildcard
StickyLabelWildCard:t=Translation needed
StickyLabelWholeWordsOnly=คำทั้งหมดเท่านั้น
ButtonOK=ตกลง(OK)
ButtonCancel=ยกเลิก

[OptionsToolbarItemsDialog]
Caption=เลือกรายการ
VirtualDrawTreeAddItems:0=รายการเมนู
ButtonAdd=เพิ่ม
ButtonCancel=ยกเลิก

[ReplaceDialog]
ButtonCancel=ยกเลิก
ButtonFind=&การค้นหา
ButtonReplaceAll=&แทนที่ทั้งหมด
Caption=แทนที่
ComboBoxSearchFor=ค้นหาเพื่อ
GroupBoxOptions=ทางเลือก
GroupBoxReplaceIn=แทนที่ใน
RadioButtonAllOpenFiles=เปิดไฟล์ ทั้งหมด
RadioButtonDeleteLine=ลบเส้น
RadioButtonReplaceWith=แทนที่ด้วย
RadioButtonWholeFile=ไฟล์ ทั้งหมด
StickyLabelCaseSensitive=กรณีรู้สึกอ่อนไหว
StickyLabelPromptOnReplace=แทนที่บนPrompt
StickyLabelRegularExpression=การแสดงออกประจำ
StickyLabelSelectedOnly=Selected only
StickyLabelSelectedOnly:t=Translation needed
StickyLabelWholeWordsOnly=คำทั้งหมดเท่านั้น
StickyLabelWildCard=Wildcard

[ConvertForm]
Caption=แปลงระหว่าง numerical หน่วย
ComboBoxType=ชนิด
ComboBoxFrom=จาก
ComboBoxTo=เพื่อ
EditValue=ค่า
EditResult=ผลลัพธ์

[PrintPreviewDialog]
ActionColors=Colors
ActionColors:h=Toggle colors
ActionExit=Exit
ActionExit:h=Exit the print preview
ActionFirst=First
ActionFirst:h=1|ไปยังหน้าที่ 1
ActionHighlight=Highlight
ActionHighlight:h=Toggle highlight
ActionLast=Last
ActionLast:h=สุดท้าย|ไปยังหน้าสุดท้าย
ActionLineNumbers=Line Numbers
ActionLineNumbers:h=เปลี่ยนจำนวนเส้น
ActionNext=Next
ActionNext:h=ถัดไป|ไปที่หน้าถัดไป
ActionPrevious=Previous
ActionPrevious:h=ที่ผ่านมา|ไปที่หน้าที่ผ่านมา
ActionPrint=Print
ActionPrint:h=การพิมพ์|พิมพ์เอกสาร
ActionWordWrap=Word wrap
ActionWordWrap:h=เปลี่ยนword wrap
ActionZoomIn=Zoom in
ActionZoomIn:h=Zoom in
ActionZoomOut=Zoom out
ActionZoomOut:h=Zoom out
ActionZoom=Zoom
ActionZoom:h=ซูม|ซูมใน/ออก
Caption=การพิมพ์ตัวอย่าง (Print Preview)

[SearchForFilesForm]
Caption=ค้นหาไฟล์
PanelSearchingFiles=การค้นหาไฟล์...

[CompareFrame]
CopySelectionLeftAction:h=เลือกทำสำเนาไปทางด้านซ้าย
CopySelectionRightAction:h=เลือกทำสำเนาไปทางด้านขวา
FindNextDifferenceAction:h=ค้นหาความแตกต่างถัดไป
LeftDocumentButtonClickAction:h=เปิดเอกสาร
LeftLabel=แถวนอนด้านซ้าย
OpenDocumentsLeftAction:h=เปิดเอกสาร
OpenDocumentsRightAction:h=เปิดเอกสาร
RefreshAction:h=Refresh documents
RightDocumentButtonClickAction:h=เปิดเอกสาร
RightLabel=แถวนอนด้านขวา
SaveLeftGridAction:h=บันทึกเอกสาร
SaveRightGridAction:h=บันทึกเอกสาร

[OptionsCompareFrame]
StickyLabelIgnoreCase=ไม่สนใจกรณี
StickyLabelIgnoreBlanks=ไม่สนใจความว่างเปล่า

[OptionsEditorCaretFrame]
StickyLabelVisible=มองเห็นได้
StickyLabelRightMouseClickMovesCaret=Right mouse click moves caret
StickyLabelRightMouseClickMovesCaret:t=Translation needed
GroupBoxNonBlinkingCaret=Non-blinking caret
GroupBoxNonBlinkingCaret:t=Translation needed
StickyLabelNonblinkingCaretEnabled=Enabled
StickyLabelNonblinkingCaretEnabled:t=Translation needed
ColorBoxNonblinkingCaretBackground=Background color
ColorBoxNonblinkingCaretBackground:t=Translation needed
ColorBoxNonblinkingCaretForeground=Foreground color
ColorBoxNonblinkingCaretForeground:t=Translation needed
GroupBoxStyles=Styles
GroupBoxStyles:t=Translation needed
ComboBoxStylesInsertCaret=Insert
ComboBoxStylesInsertCaret:t=Translation needed
ComboBoxStylesOverwriteCaret=Overwrite
ComboBoxStylesOverwriteCaret:t=Translation needed

[OptionsEditorCodeFoldingFrame]
StickyLabelVisible=มองเห็นได้
StickyLabelFoldMultilineComments=Fold multiline comments
StickyLabelFoldMultilineComments:t=Translation needed
StickyLabelHighlightIndentGuides=Highlight indent guides
StickyLabelHighlightIndentGuides:t=Translation needed
StickyLabelHighlightMatchingPair=Highlight matching pair
StickyLabelHighlightMatchingPair:t=Translation needed
StickyLabelShowCollapsedCodeHint=Show collapsed code hint
StickyLabelShowCollapsedCodeHint:t=Translation needed
StickyLabelShowCollapsedLine=Show collapsed line
StickyLabelShowCollapsedLine:t=Translation needed
StickyLabelShowIndentGuides=Show indent guides
StickyLabelShowIndentGuides:t=Translation needed
StickyLabelUncollapseByHintClick=Uncollapse by hint click
StickyLabelUncollapseByHintClick:t=Translation needed
ComboBoxMarkStyle=Mark style
ComboBoxMarkStyle:t=Translation needed
EditHintRowCount=Hint row count
EditHintRowCount:t=Translation needed

[OptionsEditorColorFrame]
ComboBoxColor=Color
ComboBoxColor:t=Translation needed
ComboBoxHighlighter=Highlighter
ComboBoxHighlighter:t=Translation needed
TabSheetEditor=Editor
TabSheetEditor:t=Translation needed
ComboBoxEditorElement=Element
ComboBoxEditorElement:t=Translation needed
ColorComboBoxEditorColor=Color
ColorComboBoxEditorColor:t=Translation needed
TabSheetElements=Elements
TabSheetElements:t=Translation needed
ComboBoxElementsName=Name
ComboBoxElementsName:t=Translation needed
ColorComboBoxElementsForeground=Foreground
ColorComboBoxElementsForeground:t=Translation needed
ColorComboBoxElementsBackground=Background
ColorComboBoxElementsBackground:t=Translation needed
GroupBoxAttributes=Attributes
GroupBoxAttributes:t=Translation needed
StickyLabelElementsAttributesBold=Bold
StickyLabelElementsAttributesBold:t=Translation needed
StickyLabelElementsAttributesItalic=Italic
StickyLabelElementsAttributesItalic:t=Translation needed
StickyLabelElementsAttributesUnderline=Underline
StickyLabelElementsAttributesUnderline:t=Translation needed
TabSheetGeneral=General
TabSheetGeneral:t=Translation needed
EditVersion=Version
EditVersion:t=Translation needed
DateEditDate=Date
DateEditDate:t=Translation needed
TabSheetAuthor=Author
TabSheetAuthor:t=Translation needed
EditName=Name
EditName:t=Translation needed
EditEmail=Email
EditEmail:t=Translation needed
TabSheetUseSkinColor=Use skin color
TabSheetUseSkinColor:t=Translation needed
LabelSkinDescription=Use skin color for selected elements
LabelSkinDescription:t=Translation needed
StickyLabelSkinActiveLineBackground=Active line background
StickyLabelSkinActiveLineBackground:t=Translation needed
StickyLabelSkinForeground=Foreground
StickyLabelSkinForeground:t=Translation needed
StickyLabelSkinSelectionForeground=Selection foreground
StickyLabelSkinSelectionForeground:t=Translation needed
StickyLabelSkinLeftMarginBackground=Left margin background
StickyLabelSkinLeftMarginBackground:t=Translation needed
StickyLabelSkinCodeFoldingBackground=Code folding background
StickyLabelSkinCodeFoldingBackground:t=Translation needed
StickyLabelSkinCompletionProposalBackground=Completion proposal background
StickyLabelSkinCompletionProposalBackground:t=Translation needed
StickyLabelSkinBackground=Background
StickyLabelSkinBackground:t=Translation needed
StickyLabelSkinSelectionBackground=Selection background
StickyLabelSkinSelectionBackground:t=Translation needed
StickyLabelSkinBookmarkPanelBackground=Bookmark panel background
StickyLabelSkinBookmarkPanelBackground:t=Translation needed
StickyLabelSkinCodeFoldingHintBackground=Code folding hint background
StickyLabelSkinCodeFoldingHintBackground:t=Translation needed
StickyLabelSkinCompletionProposalSelectionBackground=Completion proposal selection background
StickyLabelSkinCompletionProposalSelectionBackground:t=Translation needed

[OptionsEditorCompletionProposalFrame]
StickyLabelEnabled=สามารถทำได้
StickyLabelCaseSensitive=กรณีรู้สึกอ่อนไหว
ComboBoxShortcut=ทางลัด

[OptionsEditorFontFrame]
ComboBoxColor=Color
ComboBoxColor:t=Translation needed
ComboBoxElement=Element
ComboBoxElement:t=Translation needed
FontComboBoxFont=Font
FontComboBoxFont:t=Translation needed
EditFontSize=Font size
EditFontSize:t=Translation needed

[OptionsEditorLeftMarginFrame]
StickyLabelAutoSize=ขนาดอัตโนมัติ
StickyLabelShowAfterLastLine=แสดงหมายเลขเส้นหลังเส้นสุดท้าย
StickyLabelShowBookmarkPanel=แสดงป้ายที่คั่นหนังสือ
StickyLabelShowBookmarks=แสดงที่คั่นหนังสือ
StickyLabelShowInTens=จำนวนเส้นใน 10
StickyLabelShowLeadingZeros=จำนวนเส้นเริ่มต้นศูนย์
StickyLabelShowLineState=แสดงเส้นที่ปรับแต่ง
StickyLabelVisible=มองเห็นได้
EditLineNumbersStartFrom=Start from
EditLineNumbersStartFrom:t=Translation needed
EditBookmarkPanelWidth=Bookmark panel width
EditBookmarkPanelWidth:t=Translation needed
EditWidth=ความกว้าง
GroupBoxLineNumbers=Line numbers
GroupBoxLineNumbers:t=Translation needed

[OptionsEditorMatchingPairFrame]
StickyLabelEnabled=Enabled
StickyLabelEnabled:t=Translation needed
StickyLabelHighlightAfterToken=Highlight after token
StickyLabelHighlightAfterToken:t=Translation needed
StickyLabelHighlightUnmatched=Highlight unmatched
StickyLabelHighlightUnmatched:t=Translation needed

[OptionsEditorMinimapFrame]
StickyLabelVisible=Visible
StickyLabelVisible:t=Translation needed
StickyLabelShowIndentGuides=Show indent guides
StickyLabelShowIndentGuides:t=Translation needed
EditWidth=ความกว้าง

[OptionsEditorOptionsFrame]
StickyLabelAutoIndent=ไม่รอยเว้าอัตโนมัติ
StickyLabelAutoSave=บันทึกอัตโนมัติ
StickyLabelDragDropEditing=Drag drop editing
StickyLabelDragDropEditing:t=Translation needed
StickyLabelDropFiles=Drop files
StickyLabelDropFiles:t=Translation needed
StickyLabelGroupUndo=Group undo
StickyLabelGroupUndo:t=Translation needed
StickyLabelTrimTrailingSpaces=ตกแต่งการสะกดรอยช่องว่าง
StickyLabelUndoAfterSave=ยกเลิกหลังบันทึก
EditLineSpacing=การช่องว่างบรรทัดLine spacing

[OptionsEditorRightMarginFrame]
StickyLabelVisible=มองเห็นได้
StickyLabelMouseMove=การเคลื่อนที่เม้าท์
StickyLabelShowMovingHint=Show moving hint
StickyLabelShowMovingHint:t=Translation needed
EditPosition=ตำแหน่ง

[OptionsEditorScrollFrame]
StickyLabelAutosizeMaxWidth=Autosize max width
StickyLabelAutosizeMaxWidth:t=Translation needed
StickyLabelHalfPage=Half page
StickyLabelHalfPage:t=Translation needed
StickyLabelHintFollows=Hint follows
StickyLabelHintFollows:t=Translation needed
StickyLabelPastEndOfFile=โดยการเลื่อนผ่านไปถึงไฟล์สุดท้าย
StickyLabelPastEndOfLineMarker=โดยการเลื่อนผ่านไปถึงบรรทัดสุดท้าย
StickyLabelShowHint=Show hint
StickyLabelShowHint:t=Translation needed

[OptionsEditorSearchFrame]
StickyLabelDocumentSpecificSearch=การค้นหาที่เจาะจงเอกสาร
StickyLabelShowSearchMap=แสดงแผนที่การค้นหา
StickyLabelHighlightResults=แสดงนักส่องแสงการค้นหา

[OptionsEditorSelectionFrame]
StickyLabelVisible=มองเห็นได้
StickyLabelALTSetsColumnMode=ALT sets column mode
StickyLabelALTSetsColumnMode:t=Translation needed
StickyLabelHighlightSimilarTerms=Highlight similar terms
StickyLabelHighlightSimilarTerms:t=Translation needed
StickyLabelToEndOfLine=To end of line
StickyLabelToEndOfLine:t=Translation needed
StickyLabelTripleClickRowSelect=สาม-กดเลือกแถวนอน

[OptionsEditorSpecialCharsFrame]
StickyLabelUseTextColor=Use text color
StickyLabelUseTextColor:t=Translation needed
ColorComboBoxColor=Color
ColorComboBoxColor:t=Translation needed
ComboBoxStyle=Style                      
ComboBoxStyle:t=Translation needed
GroupBoxEndOfLine=End of line
GroupBoxEndOfLine:t=Translation needed
StickyLabelEndOfLineVisible=Visible
StickyLabelEndOfLineVisible:t=Translation needed
GroupBoxEndOfLine=Color
GroupBoxEndOfLine:t=Translation needed
ComboBoxEndOfLineStyle=Style
ComboBoxEndOfLineStyle:t=Translation needed
GroupBoxSelection=Selection
GroupBoxSelection:t=Translation needed
StickyLabelSelectionVisible=Visible
StickyLabelSelectionVisible:t=Translation needed
ColorComboBoxSelectionColor=Color
ColorComboBoxSelectionColor:t=Translation needed

[OptionsEditorTabulatorFrame]
StickyLabelSelectedBlockIndent=Selected block indent
StickyLabelSelectedBlockIndent:t=Translation needed
StickyLabelTabsToSpaces=แถบเพื่อช่องว่าง
EditWidth=ความกว้าง

[OptionsMainMenuFrame]
StickyLabelUseSystemFont=ใช้ระบบแบบอักษร
FontComboBoxFont=Font
FontComboBoxFont:t=Translation needed
EditFontSize=Font size
EditFontSize:t=Translation needed

[OptionsOutputFrame]
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowCheckBox=Show check box
EditIndent=Indent

[OptionsPrintFrame]
ComboBoxDocumentName=ชื่อเอกสาร
ComboBoxPageNumber=จำนวนหน้า
ComboBoxPrintedBy=พิมพ์โดย
ComboBoxDateTime=เวลาวันที่
StickyLabelShowHeaderLine=แสดงเส้นหัวข้อ
StickyLabelShowFooterLine=แสดงเส้นข้อความท้ายหน้า
StickyLabelShowLineNumbers=แสดงจำนวนเส้น
StickyLabelWordWrap=Word wrap

[OptionsSQLAlignmentsFrame]
ComboBoxKeywordAlign=คำค้นอยู่ในเส้นตรง
StickyLabelKeywordAlignmentLeftJustify=ทางซ้ายเคร่งครัดตั้งให้ตรงคำค้น

[OptionsSQLCapitalizationFrame]
ComboBoxKeywords=คำค้น
ComboBoxIdentifier=ผู้ค้นหา
ComboBoxQuotedIdentifier=ผู้ค้นหาที่อ้าง
ComboBoxTableName=ชื่อตาราง
ComboBoxColumnName=ชื่อคอลัมภ์
ComboBoxAliasName=ชื่ออีกชื่อหนึ่ง
ComboBoxVariableName=ชื่อตัวแปร
ComboBoxFunctionName=ชื่อฟังก์ชัน
ComboBoxDataType=ชนิดข้อมูล

[OptionsSQLFormatterFrame]
ComboBoxDatabase=ฐานข้อมูล

[OptionsSQLIndentationFrame]
EditIndentLength=ไม่รอยเว้าความยาว
StickyLabelUseTab=ใช้แถบ
EditTabSize=ขนาดแถบ
EditFunctionBodyIndent=ร่างกายฟังก์ชันไม่รอยเว้า
StickyLabelBlockOnNewLine=สะกัดบนบรรทัดใหม่
EditBlockLeftIndentSize=กล่องทิ้งไม่รอยเว้าขนาด
EditBlockRightIndentSize=สิทธ์กล่องไม่รอยเว้าขนาด
EditBlockIndentSize=กล่องไม่รอยเว้าขนาด
EditSingleStatementIndent=ถ้า/มิฉะนั้นแถลงการณ์เดี่ยวไม่รอยเว้าขนาด

[OptionsSQLInsertFrame]
ComboBoxColumnListStyle=สไตล์รายการคอลัมภ์
ComboBoxValueListStyle=สไตล์รายการค่า
EditInsertColumnsPerLine=ใส่คอลัมภ์ต่อบรรทัด
StickyLabelParenthesisInSeparateLines=วงเล็บในบรรทัดที่แยกออกมา

[OptionsSQLSelectFrame]
TabSheetColumnList=รายการคอลัมภ์
TabSheetSubquery=Subquery
TabSheetIntoClause=เข้าไปในอนุประโยค
TabSheetFromJoinClause=จาก/เข้าร่วมอนุประโยค
TabSheetAndOrKeyword=และ/หรือคำค้น
TabSheetGroupByClause=กลุ่มโดยอนุประโยค
TabSheetHavingClause=มีอนุประโยค
TabSheetOrderByClause=สั่งโดยอนุประโยค
ComboBoxColumnListStyle=สไตล์
ComboBoxColumnListLineBreak=บรรทัดพัง
StickyLabelAlignAlias=อยู่ในเส้นตรงชื่ออีกชื่อหนึ่ง
StickyLabelColumnInNewLine=คอลัมภ์ในบรรทัดใหม่
StickyLabelTreatDistinctAsVirtualColumn=สิ่งที่ทำให้เพลิดเพลินที่แตกต่างเป็นคอลัมภ์เสมือนจริง
StickyLabelNewLineAfterIn=บรรทัดใหม่หลังใน
StickyLabelNewLineAfterExists=บรรทัดใหม่หลังมีอยู่
StickyLabelNewlineAfterComparisonOperator=หน่วยงานหลักใหม่หลังพนักงานโทรศัพท์การเปรียบเทียบ
StickyLabelNewlineBeforeComparisonOperator=หน่วยงานหลักใหม่ก่อนพนักงานโทรศัพท์การเปรียบเทียบ
StickyLabelIntoClauseInNewLine=เข้าไปในอนุประโยคในบรรทัดใหม่
ComboBoxFromClauseStyle=สไตล์
StickyLabelFromClauseInNewLine=จากอนุประโยคในบรรทัดใหม่
StickyLabelJoinClauseInNewLine=เข้าร่วมอนุประโยคในบรรทัดใหม่
StickyLabelAlignJoinWithFromKeyword=อยู่ในเส้นตรงเข้าร่วมกับจากคำค้น
StickyLabelAlignAndOrWithOnInJoinClause=อยู่ในเส้นตรงและ/หรือกับบนในเข้าร่วมอนุประโยค
StickyLabelAlignAliasInFromClause=อยู่ในเส้นตรงชื่ออีกชื่อหนึ่งในจากอนุประโยค
ComboBoxAndOrLineBreak=บรรทัดพัง
StickyLabelAndOrUnderWhere=และ/หรือใต้ที่ซึ่ง
StickyLabelWhereClauseInNewline=ที่ซึ่งอนุประโยคในบรรทัดใหม่
StickyLabelWhereClauseAlignExpr=ที่ซึ่งอนุประโยคอยู่ในเส้นตรง expr
ComboBoxGroupByClauseStyle=สไตล์
StickyLabelGroupByClauseInNewLine=กลุ่มโดยอนุประโยคในบรรทัดใหม่
StickyLabelHavingClauseInNewLine=มีอนุประโยคในบรรทัดใหม่
ComboBoxOrderByClauseStyle=สไตล์
StickyLabelOrderByClauseInNewLine=สั่งโดยอนุประโยคในบรรทัดใหม่

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=สไตล์รายการคอลัมภ์

[OptionsSQLWhitespaceFrame]
StickyLabelSpaceAroundOperator=ช่องว่างรอบ ผู้กระทำของ การแสดงออก arithmetric
StickyLabelSpaceInsideCreate=ช่องว่างข้างในวงเล็บในสร้างฟังก์ชัน/โพรซิเดอร์
StickyLabelSpaceInsideExpression=ช่องว่างข้างในวงเล็บในการแสดงออก
StickyLabelSpaceInsideSubquery=ช่องว่างข้างในวงเล็บใน subquery
StickyLabelSpaceInsideFunction=ช่องว่างข้างในวงเล็บในการเรียกฟังก์ชัน
StickyLabelSpaceInsideTypename=ช่องว่างข้างใน วงเล็บของ typename ในสร้างตาราง

[OptionsStatusBarFrame]
StickyLabelUseSystemFont=ใช้ระบบแบบอักษร
FontComboBoxFont=Font
FontComboBoxFont:t=Translation needed
EditFontSize=Font size
EditFontSize:t=Translation needed
StickyLabelShowMacro=Show macro
StickyLabelShowMacro:t=Translation needed
StickyLabelShowCaretPosition=Show caret position
StickyLabelShowCaretPosition:t=Translation needed
StickyLabelShowKeyState=Show key state
StickyLabelShowKeyState:t=Translation needed
StickyLabelShowModified=Show modified
StickyLabelShowModified:t=Translation needed

[OptionsToolbarFrame]
VirtualDrawTree:h=ใช้เมาท์ลากและทิ้งเพื่อเคลื่อนย้ายรายการเมนู. กดเม้าท์ขวาเมนูเล็กๆเพื่อใส่และลบรายการ.
VirtualDrawTree:0=รายการเมนู
ActionAddItem=เพิ่มรายการ
ActionAddItem:h=เพิ่มรายการ
ActionDelete=ลบ
ActionDelete:h=ลบ
ActionAddDivider=เพิ่มนักหาร
ActionAddDivider:h=เพิ่มนักหาร
ActionReset=คืนค่า
ActionReset:h=คืนค่ารายการเมนู
ActionMoveUp=Move up     
ActionMoveUp:h=Move selected item up
ActionMoveUp:t=Translation needed
ActionMoveDown=Move down     
ActionMoveDown:h=Move selected item down
ActionMoveDown:t=Translation needed

[AboutDialog]
Caption=เกี่ยวกับ EditBone
LabelCopyright=ลิขสิทธิ์ %s. ขอสงวนลิขสิทธิ์ทั้งหมด.
LabelMemoryAvailable=หน่วยความจำมีให้เพื่อวินโดว์ส: %s
ButtonOK=OK
ButtonDonations=การบริจาค
LabelDevelopmentEnvironment=สภาพแวดล้อมการพัฒนา
LabelThirdPartyComponents=ส่วนประกอบกลุ่มที่ 3
LabelLanguageFileContributors=ผู้เขียนเรื่องให้หนังสือพิมพ์ไฟล์ภาษา
LabelIcons=ไอคอน
LabelVersion=เวอร์ชัน %s (%d-bit)

[DirectoryTabDialog]
ButtonCancel=ยกเลิก
StickyLabelExcludeOtherBranches=เว้นสาขาไดเรคทอรี่อื่นๆ
ButtonOK=&ตกลง(OK)
EditRootDirectory=ไดเรคทอรี่ราก
ComboBoxDrives=ไดร์ว
ComboBoxFileMask=หน้ากากแฟ้ม
EditTabName=ชื่อแถบ
GroupBoxOptions=ทางเลือก

[LanguageEditorForm]
ActionExit:h=ปิดตัวแก้ภาษา
ActionExit:t=Translation needed
ActionExit=Exit
ActionFileNew:h=สร้างไฟล์ภาษาใหม่
ActionFileNew:t=Translation needed
ActionFileNew=New
ActionFileOpen:h=เปิดไฟล์ภาษาที่มีอยู่
ActionFileOpen:t=Translation needed
ActionFileOpen=Open
ActionFileSave:h=บันทึกไฟล์ภาษา
ActionFileSave:t=Translation needed
ActionFileSave=Save
VirtualDrawTree:0=วัตถุ
VirtualDrawTree:1=หัวเรื่อง
VirtualDrawTree:2=การใบ้
VirtualDrawTree:3=ทางลัด

[OptionsForm]
ActionCompare=เปรียบเทียบไฟล์
ActionDirectory=ไดเรคทอรี่
ActionDirectoryTabs=แถบ
ActionEditor=ผู้แก้ไข
ActionEditorCaret:t=Translation needed
ActionEditorCaret=Caret
ActionEditorCodeFolding:t=Translation needed
ActionEditorCodeFolding=Code folding
ActionEditorColors:t=Translation needed
ActionEditorColors=Colors
ActionEditorCompletionProposal=ข้อเสนอการทำเสร็จ
ActionEditorDefaults:t=Translation needed
ActionEditorDefaults=Defaults
ActionEditorFonts=แบบอักษร
ActionEditorLeftMargin=ส่วนที่เกินซ้าย
ActionEditorMatchingPair:t=Translation needed
ActionEditorMatchingPair=Matching pair
ActionEditorMinimap:t=Translation needed
ActionEditorMinimap=Minimap
ActionEditorRightMargin=ส่วนที่เกินที่ใช่
ActionEditorScroll:t=Translation needed
ActionEditorScroll=Scroll
ActionEditorSearch=การค้นหา
ActionEditorSelection:t=Translation needed
ActionEditorSelection=Selection
ActionEditorSpecialChars:t=Translation needed
ActionEditorSpecialChars=Special chars
ActionEditorTabs:t=Translation needed
ActionEditorTabs=Tabs
ActionEditorTabulator:t=Translation needed
ActionEditorTabulator=Tabulator
ActionFileTypes=ชนิดไฟล์
ActionMainMenu=เมนูหลัก
ActionOutput=ผลผลิต
ActionOutputTabs=แถบ
ActionPrint=การพิมพ์
ActionSQLAlignments=ตั้งให้ตรง
ActionSQLCapitalization=Capitalization
ActionSQLFormatter=แบบแผน SQL
ActionSQLIndentation=ร่นเข้าไป
ActionSQLInsert=ใส่
ActionSQLSelect=เลือก
ActionSQLUpdate=ของใหม่
ActionSQLWhitespace=Whitespace
ActionStatusBar=แถบสถานะ
ActionToolbar=แถบเครื่องมือ
ButtonCancel=ยกเลิก
ButtonOK=&ตกลง(OK)
Caption=ข้อกำหนด

[UnicodeCharacterMapForm]
Caption=Unicode Character Map

[OptionsDirectoryFrame]
StickyLabelAutoHide=Auto hide
StickyLabelAutoHide:t=Translation needed
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowHiddenFiles=แสดงไฟล์ซ่อนเร้น
StickyLabelShowSystemFiles=แสดงไฟล์ระบบ
StickyLabelShowArchiveFiles=แสดงไฟล์เอกสารสำคัญ
StickyLabelShowOverlayIcons=แสดงทับไอคอน
EditIndent=Indent

[OptionsDirectoryTabsFrame]
StickyLabelMultiline=Multiline
StickyLabelShowCloseButton=แสดงปุ่มปิด
StickyLabelShowImage=แสดงรูปภาพ
StickyLabelCloseTabByDblClick=ปิดแถบโดยกด double-click
StickyLabelCloseTabByMiddleClick=ปิดแถบโดยmiddle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=บันทึกแถบ
StickyLabelRightClickSelect=กดเม้าท์ขวาเลือก

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Color
ComboBoxDefaultColor:t=Translation needed
ComboBoxDefaultEncoding=Encoding
ComboBoxDefaultEncoding:t=Translation needed
ComboBoxDefaultHighlighter=Highlighter
ComboBoxDefaultHighlighter:t=Translation needed
ComboBoxDefaultSQLHighlighter=SQL highlighter
ComboBoxDefaultSQLHighlighter:t=Translation needed

[OptionsEditorTabsFrame]
StickyLabelMultiline=Multiline
StickyLabelShowCloseButton=แสดงปุ่มปืด
StickyLabelShowImage=แสดงรูปภาพ
StickyLabelCloseTabByDblClick=ปิดแถบโดยdouble-click
StickyLabelCloseTabByMiddleClick=ปิดแถบโดยmiddle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=บันทึกแถบ
StickyLabelRightClickSelect=กดเม้าท์ขวาเลือก

[OptionsFileTypesFrame]
EditExtensions=ส่วนขยาย
VirtualDrawTree:0=ชนิดไฟล์

[OptionsOutputTabsFrame]
StickyLabelMultiline=Multiline
StickyLabelShowCloseButton=แสดงปุ่มปิด
StickyLabelShowImage=แสดงรูปภาพ
StickyLabelCloseTabByDblClick=แถบปิดโดยกด double-click
StickyLabelCloseTabByMiddleClick=แถบปิดโดยmiddle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=บันทึกแถบ
StickyLabelRightClickSelect=กดเม้าท์ขวาเลือก

[SQLFormatterConstant]
Stacked=Stacked
Wrapped=Wrapped
AfterComma=หลังจุดจุลภาค
BeforeComma=ก่อนจุดจุลภาค
BeforeCommaWithSpace=ก่อนจุดจุลภาคกับช่องว่าง
NoLineBreak=ไม่มีแตกบรรทัด
BeforeAndOr=ก่อนและ/หรือ
AfterAndOr=หลังและ/หรือ
Left=ด้านซ้าย
Right=ด้านขวา
None=ไม่มี
Uppercase=ตัวพิมพ์ใหญ่
Uppercase=ตัวพิมพ์เล็ก
SentenceCase=กรณีประโยค
NoChange=ไม่มีการแลกเปลี่ยน

[ConvertConstant]
Distance=ระยะ
Micromicrons=Micromicrons
Angstroms=Angstroms
Millimicrons=Millimicrons
Microns=Microns
Millimeters=มิลลิเมตร
Centimeters=เซ็นติเมตร
Decimeters=Decimeters
Meter=มิเตอร์
Decameters=Decameters
Hectometers=Hectometers
Kilometers=กิโลเมตร
Megameters=Megameters
Gigameters=Gigameters
Inches=นิ้ว
Feet=ฟุต
Yards=หลา
Miles=ไมล์
NauticalMiles=ไมล์เกี่ยวกับทะเล
AstronomicalUnits=หน่วยเกี่ยวกับการดูดาว
LightYears=ปีแสง
Parsecs=Parsecs
Cubits=ศอก
Fathoms=ระยะแขน
Furlongs=Furlongs
Hands=มือ
Paces=Paces
Rods=Rods
Chains=Chains
Links=Links
Picas=Picas
Points=จุด
Area=พื้นที่
SquareMillimeters=มิลลิเมตรเท่าเทียมกัน
SquareCentimeters=เซ็นติเมตรเท่าเทียมกัน
SquareDecimeters=decimeters เท่าเทียมกัน
SquareMeters=มิเตอร์เท่าเทียมกัน
SquareDecameters=decameters เท่าเทียมกัน
SquareHectometers=hectometers เท่าเทียมกัน
SquareKilometers=กิโลเมตรเท่าเทียมกัน
SquareInches=จตุรัสนิ้ว
SquareFeet=เท้าเท่าเทียมกัน
SquareYards=ลานบ้านเท่าเทียมกัน
SquareMiles=ไมล์เท่าเทียมกัน
Acres=เอเคอร์
Centares=Centares
Ares=คือ
Hectares=Hectares
SquareRods=แขนงไม้เท่าเทียมกัน
Volume=ปริมาณ
CubicMillimeters=ลูกบาศ์กมิลลิเมตร
CubicCentimeters=ลูกบาศ์กเซ็นติเมตร
CubicDecimeters=ลูกบาศ์ก decimeters
CubicMeters=ลูกบาศ์กมิเตอร์
CubicDecameters=ลูกบาศ์ก decameters
CubicHectometers=ลูกบาศ์ก hectometers
CubicKilometers=ลูกบาศ์กกิโลเมตร
CubicInches=ลูกบาศ์กนิ้ว
CubicFeet=ลูกบาศ์กเท้า
CubicYards=ลูกบาศ์กลานบ้าน
CubicMiles=ลูกบาศ์กไมล์
MilliLiters=Milli ลิตร
CentiLiters=Centi ลิตร
DeciLiters=หนึ่งในสิบลิตร
Liters=ลิตร
DecaLiters=Deca ลิตร
HectoLiters=Hecto ลิตร
KiloLiters=กิโลลิตร
AcreFeet=เท้าเอเคอร์
AcreInches=เอเคอร์นิ้ว
Cords=ด้าย
CordFeet=เท้าเชือก
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=ของเหลวแกลอน
FluidPints= 1/8ควอร์ตของไหล
FluidQuarts=quarts ของไหล
FluidCups=ถ้วยของไหล
FluidGills=เหงือกปลาของไหล
FluidOunces=ounces ของไหล
FluidTablespoons=ช้อนโต๊ะของไหล
FluidTeaspoons=teaspoons ของไหล
DryGallons=ทำให้แห้งแกลอน
DryQuarts=quarts แห้ง
DryPints= 1/8ควอร์ตแห้ง
DryPecks=ทำให้แห้งจิก
DryBuckets=ถังแห้ง
DryBushels=ตะกร้าแห้ง
UKGallons=แกลอนอังกฤษ
UKPottle=pottles อังกฤษ
UKQuarts=quarts อังกฤษ
UKPints= 1/8ควอร์ตอังกฤษ
UKGill=เหงือกปลาอังกฤษ
UKOunces=ounces อังกฤษ
UKPecks=จิกอังกฤษ
UKBuckets=ถังอังกฤษ
UKBushels=ตะกร้าอังกฤษ
Mass=มวล
Nanograms=Nanograms
Micrograms=Micrograms
Milligrams=มิลลิกรัม
Centigrams=เซนติกรัม
Decigrams=Decigrams
Grams=กรัม
Decagrams=เดซิกรัม
Hectograms=Hectograms
Kilograms=กิโลกรัม
MetricTons=เมตริกตัน
Drams=Drams
Grains=Grains
LongTons=ตันนาน
Tons=ตัน
Ounces=เอาวน์
Pounds=ปอนด์
Stones=Stones
NumeralSystem=ระบบตัวเลข
Binary=เลขฐาน 2
Decimal=ทศนิยม
Hexadecimal=เลขฐาน 16
Temperature=อุณหภูมิ
Celsius=เซ็ลเซียส
Kelvin=ชื่อหน่วยวัดอุณหภูมิ ใช้สัญลักษณ์ K
Fahrenheit=เกี่ยวกับอุณหภูมิฟาห์เรนไฮท์
Time=เวลา
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=วินาที
Seconds=วินาที
Minutes=นาที
Hours=ชั่วโมง
Days=วัน
Weeks=สัปดาห์
Fortnights=Fortnights
Months=เดือน
Years=ปี
Decades=ทศวรรษ
Centuries=ศตวรรษ
Millennia=Millennia
DateTime=วันที่เวลา
JulianDate=วันที่จูเรียน
ModifiedJulianDate=วันที่จูเรียนที่แก้ไข
